# Data Preparation (Preprocessing)


## Introduction

<br>
<div style="text-align: justify">Data preparation is the process of constructing a clean dataset from one or more sources such that the data can be fed into subsequent stages of a data science pipeline. Common data preparation tasks include handling missing values, outlier detection, feature/variable scaling, and feature encoding. Data preparation is often a time-consuming process.</div>

<br>
<div style="text-align: justify">Python provides us with a specialized library, Pandas, for data preparation and analysis. Thus, understanding the functions of this library is of the utmost importance for those who are beginners in data science. In this topic, we shall mostly be using Pandas along with Numpy and Matplotlib.</div>

## Pandas for Data Preparation
<br>
<div style="text-align: justify">Pandas is a specialized library that makes the tedious tasks of data preparation and analysis easy. Pandas uses two data structures called <b>Series</b> and <b>DataFrame</b>. These data structures are designed to work with labeled or relational data and are suitable to manage data stored in a tabular format such as in
databases, Excel spreadsheets, and CSV files.</div>
<br>
<div style="text-align: justify">Since we shall be working with Numpy and Pandas, we import
both. The general practice for importing these libraries is as
follows:</div>

In [1]:
import numpy as np
import pandas as pd

<div style="text-align: justify">Thus, each time we see pd and np, we are making reference to
an object or method referring to these two libraries.</div>

## Pandas Data Structures
<br>
<div style="text-align: justify">All operations for data preprocessing and analysis are
centralized on two data structures:</div>

- Series,
- DataFrame.

<br>
<div style="text-align: justify">The Series data structure is designed to store a sequence of
one-dimensional data, whereas the DataFrame data structure
is designed to handle data having several dimensions.</div>

## The Series

<div style="text-align: justify">The Series data structure, similar to a Numpy array, is used
to handle one-dimensional data. It provides features not
provided by simple Numpy arrays. To create a series object,
we use the Series () constructor.</div>

In [2]:
seriesdata = pd.Series([1, -3, 5, 20]) #take note of capital S in Series
seriesdata
#myseries = [1, -3, 5, 20]
#myseries

0     1
1    -3
2     5
3    20
dtype: int64

<div style="text-align: justify">dtype: int64 means the data type of values in a Series is an
integer of 64 bits.</div>
<br>
<div style="text-align: justify">The structure of a Series object is simple. It consists of two
arrays, index and value, associated with each other. The first
array (column) stores the index of the data, whereas the
second array (column) stores the actual values.</div>
<br>

<div style="text-align: justify">Pandas assigns numerical indices starting from 0 onward if we
do not specify any index. It is sometimes preferable to create
a Series object using descriptive and meaningful labels. In
this case, we can assign indices during the constructor call as
follows:</div>
<br>

In [3]:
seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1

a     1
b    -3
c     5
d    20
dtype: int64

<div style="text-align: justify">Two attributes of the Series data structure index and values
can be used to view the values and index separately.</div>

In [4]:
seriesdata1.values

array([ 1, -3,  5, 20])

In [5]:
seriesdata1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

<div style="text-align: justify">The elements of a Series can be accessed in the same way we
access the array elements. Type the following to understand
this process.</div>

In [6]:
#seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1[2]

5

In [7]:
#seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1[0:2]

a    1
b   -3
dtype: int64

In [8]:
#seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1['b']

-3

In [9]:
#seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1[['b','c']]

b   -3
c    5
dtype: int64

<div style="text-align: justify">Note double brackets in the aforementioned indexing that
uses the list of labels within an array. We can select the value
by index or label, and assign a different value to it, for example:</div>

In [10]:
#seriesdata1 = pd.Series([1, -3, 5, 20], index = ['a','b','c','d'])
seriesdata1[0]=2
seriesdata1

seriesdata1['b']=6
seriesdata1

a     2
b     6
c     5
d    20
dtype: int64

<div style="text-align: justify">We can create a Series object from an existing array as follows:</div>

In [11]:
myarray = np.array([1,-2,3,4])
myarray
myseries = pd.Series(myarray)
myseries

0    1
1   -2
2    3
3    4
dtype: int64

<div style="text-align: justify">Most operations performed on simple Numpy arrays are valid
on a Series data structure. Additional functions are provided
for Series data structure to facilitate data processing. We
can use conditional operators to filter or select values. For
example, to get values greater than 2, we may use:</div>

In [12]:
myseries[myseries>2]

2    3
3    4
dtype: int64

<div style="text-align: justify">Mathematical operations can be performed on the data stored
in a Series. For example, to take the logarithm of values stored
in myseries, we enter the following command that uses the
log function defined in the Numpy library.</div>

In [13]:
np.log(myseries)

/home/andy/.local/lib/python3.10/site-packages/pandas/core/arraylike.py:402: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

0    0.000000
1         NaN
2    1.098612
3    1.386294
dtype: float64

<div style="text-align: justify">Note that the logarithm of a negative number is undefined; it
is returned as a NaN, standing for Not a Number. Thus, Python
throws the following warning:</div>

<div style="text-align: justify">NaN values are used to indicate an empty field or an
undefinable quantity. We can define NaN values by typing
np.NaN. The isnull( ) and notnull( ) functions of Pandas are
useful to identify the indices without a value or NaN.</div>

<div style="text-align: justify">We create a Series, mycolors, to perform some common
operations that can be applied to a Series.</div>

In [14]:
mycolors = pd.Series([1,2,3,4,5,4,3,2], index=['white','black','blue','green','yellow','green','blue','black'])
mycolors

white     1
black     2
blue      3
green     4
yellow    5
green     4
blue      3
black     2
dtype: int64

<div style="text-align: justify">The Series, mycolor, contains some duplicate values. We can
get unique values from the Series by typing:</div>

In [15]:
mycolors.unique()

array([1, 2, 3, 4, 5])

<div style="text-align: justify">Another useful function value_counts() returns how many
times the values are present in a Series.</div>

In [16]:
mycolors.value_counts()

2    2
3    2
4    2
1    1
5    1
dtype: int64

<div style="text-align: justify">This output indicates that the values 2, 3, and 4 are present
twice each, whereas values 1 and 5 are present once only.</div>

<br>
<div style="text-align: justify">To find a particular value contained in a Series data structure,
we use isin( ) function that evaluates the membership. It
returns the Boolean value True or False, which can be used to
filter the data present in a Series. For example, we search for
values 5 and 7 in the Series mycolors by typing.</div>

In [17]:
#mycolors = pd.Series([1,2,3,4,5,4,3,2]
mycolors.isin([5,7])

white     False
black     False
blue      False
green     False
yellow     True
green     False
blue      False
black     False
dtype: bool

<div style="text-align: justify">We can use the Boolean values returned by mycolors.isin([5,7])
as indices to the Series mycolors to get the filtered Series.</div>

In [18]:
mycolors[mycolors.isin([5,7])]

yellow    5
dtype: int64

<div style="text-align: justify">A Series can be created from an already defined dictionary.</div>

In [19]:
mydict = {
    "white": 10,
    "black": 15,
    "red": 30,
    "yellow": 40
}

myseries2 = pd.Series(mydict)
myseries2

white     10
black     15
red       30
yellow    40
dtype: int64

## The DataFrame
<br>
<div style="text-align: justify">The DataFrame, a tabular data structure, is very similar to an
Excel Spreadsheet. It can be considered an extension of a
Series to multiple dimensions. The DataFrame consists of an
ordered group of columns. Every column contains values of
numeric, string, or Boolean, etc. types.</div>

<br>
<div style="text-align: justify">A DataFrame can be created by passing a dictionary object to
the DataFrame() constructor. This dictionary object contains
a key for each column with a corresponding array of values for
each of them.</div>

In [20]:
import pandas as pd
data = {
    'color': ['blue','green','yellow','red','black'],
    'items':['ball','pen','pencil','marker','mug'],
    'price':[2.5,1.2,0.6,4.5,9]
}

myframe = pd.DataFrame(data)
myframe

    color   items  price
0    blue    ball    2.5
1   green     pen    1.2
2  yellow  pencil    0.6
3     red  marker    4.5
4   black     mug    9.0

In [21]:
mydata = {
    'Employee Name': ['Muthu', 'Ali', 'Cheong'],
    'Skillset':['Python','Powerpoint', 'Tablue'],
    'Experience(years)': [4,5,2]
}

myframe = pd.DataFrame(mydata)
myframe

  Employee Name    Skillset  Experience(years)
0         Muthu      Python                  4
1           Ali  Powerpoint                  5
2        Cheong      Tablue                  2

<div style="text-align: justify">We can select a few columns from the DataFrame in any
arbitrary order, using the columns option. The columns will
always be created in the order we specify irrespective of how
they are stored within the dictionary object. For example,</div>

In [22]:
myframe2 = pd.DataFrame(mydata, columns = ['Experience(years)', 'Employee Name'])
myframe2

   Experience(years) Employee Name
0                  4         Muthu
1                  5           Ali
2                  2        Cheong

<div style="text-align: justify">If we use the index option, we can specify indices of our choice
to the DataFrame.</div>

In [23]:
myframe3 = pd.DataFrame(mydata, index=['zero','one','two'])
myframe3

     Employee Name    Skillset  Experience(years)
zero         Muthu      Python                  4
one            Ali  Powerpoint                  5
two         Cheong      Tablue                  2

In [24]:
myframe3[myframe3['Experience(years)']>4]

    Employee Name    Skillset  Experience(years)
one           Ali  Powerpoint                  5

In [25]:
myframe3.T

                     zero         one     two
Employee Name       Muthu         Ali  Cheong
Skillset           Python  Powerpoint  Tablue
Experience(years)       4           5       2

<div style="text-align: justify">An alternative way to create a DataFrame is to pass input
arguments to the DataFrame() constructor in the following
order:</div>

1. a data matrix,
2. an array of the labels for the indices (index option),
3. an array containing the column names (columns option).

<br>
<div style="text-align: justify">We can use np.arange() to create an array. To convert this
array to a matrix, we use reshape() function. For example, we
type the following command.</div>

In [26]:
np.arange(15).reshape((3,5))

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

<div style="text-align: justify">This is a 2-dimensional array or a matrix of size three rows and
five columns (3x5). To create the DataFrame, myframe4, from
this matrix, we type:</div>

In [27]:
myframe4 = pd.DataFrame(np.arange(15).reshape((3,5)), index=['row0','row1','row2'], columns=['col0','col1','col2','col3','col4'])
myframe4

      col0  col1  col2  col3  col4
row0     0     1     2     3     4
row1     5     6     7     8     9
row2    10    11    12    13    14

In [28]:
myframe4.columns

Index(['col0', 'col1', 'col2', 'col3', 'col4'], dtype='object')

In [29]:
myframe4.index

Index(['row0', 'row1', 'row2'], dtype='object')

In [30]:
myframe4.values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [31]:
myframe4['col1']

row0     1
row1     6
row2    11
Name: col1, dtype: int64

In [32]:
myframe4

      col0  col1  col2  col3  col4
row0     0     1     2     3     4
row1     5     6     7     8     9
row2    10    11    12    13    14

In [33]:
myframe4['row0':'row2']

      col0  col1  col2  col3  col4
row0     0     1     2     3     4
row1     5     6     7     8     9
row2    10    11    12    13    14

In [34]:
myframe4.index.name = 'Rows'
myframe4.columns.name = 'Columns'
myframe4

Columns  col0  col1  col2  col3  col4
Rows
row0        0     1     2     3     4
row1        5     6     7     8     9
row2       10    11    12    13    14

In [35]:
myframe4['col5'] = np.random.randint(100, size = 3)
myframe4

Columns  col0  col1  col2  col3  col4  col5
Rows
row0        0     1     2     3     4    55
row1        5     6     7     8     9    57
row2       10    11    12    13    14     6

In [36]:
np.random.randint(1,5, size=100)

array([4, 4, 2, 4, 4, 1, 2, 4, 2, 3, 4, 2, 4, 2, 3, 1, 4, 2, 2, 4, 1, 1,
       2, 3, 2, 4, 1, 4, 1, 2, 2, 1, 3, 2, 3, 4, 4, 1, 3, 1, 3, 3, 2, 2,
       2, 3, 1, 1, 4, 4, 3, 1, 2, 2, 3, 1, 1, 2, 2, 3, 3, 3, 1, 1, 4, 2,
       1, 4, 2, 2, 3, 3, 3, 4, 4, 3, 3, 3, 1, 2, 4, 2, 3, 4, 4, 1, 2, 1,
       1, 3, 1, 4, 1, 2, 3, 4, 1, 2, 1, 1])

In [37]:
myframe4['col4']['row0'] = 50
myframe4

Columns  col0  col1  col2  col3  col4  col5
Rows
row0        0     1     2     3    50    55
row1        5     6     7     8     9    57
row2       10    11    12    13    14     6

## Putting Data Together
<br>
<div style="text-align: justify">Once we have our data in a DataFrame, it is ready to be
manipulated for preparation so that the data can be effortlessly
analyzed and visualized. We illustrate several operations that
can be performed using the Pandas library to carry out data
preparation. The data contained in a Series or a DataFrame
object can be put together in the following ways:</div>

- Concatenating: pandas.concat() function concatenates the objects along an axis.

- Merging: pandas.merge( ) function connects the rows in a DataFrame based on one or more keys by implementing join operations.

- Combining: pandas.DataFrame.combine_first( ) function allows us to connect overlapped data to fill in missing values in a data structure.

### Concatenating Data
<br>
<div style="text-align: justify">The concatenation is a process of linking together two or
more separate data structures and placing them next to each
other to make a single entity. Similar to Numpys concatenate
() function, Pandas provides concat () function to perform
concatenation. Type the following commands to generate two
Series of five randomly generated numbers each.</div>

In [38]:
myseries1 = pd.Series(np.random.rand(5), index=[0,1,2,3,4])
myseries1

0    0.409201
1    0.972325
2    0.294228
3    0.147080
4    0.787371
dtype: float64

In [39]:
myseries2 = pd.Series(np.random.rand(5), index=[0,1,2,3,4])
myseries2

0    0.383227
1    0.533321
2    0.275369
3    0.829828
4    0.362479
dtype: float64

<div style="text-align: justify">To concatenate myseries1 and myseries2, type the following
command:</div>

In [40]:
pd.concat([myseries1,myseries2])

0    0.409201
1    0.972325
2    0.294228
3    0.147080
4    0.787371
0    0.383227
1    0.533321
2    0.275369
3    0.829828
4    0.362479
dtype: float64

<div style="text-align: justify">The concat() function works on axis = 0 (rows), by default, to
return a Series. If we set axis = 1 (columns), then the result will
be a DataFrame.</div>

In [41]:
pd.concat([myseries1,myseries2], axis=1)

          0         1
0  0.409201  0.383227
1  0.972325  0.533321
2  0.294228  0.275369
3  0.147080  0.829828
4  0.787371  0.362479

<div style="text-align: justify">If we use the option <b>keys</b>, along the axis = 1, the provided keys
become the column names of the DataFrame.</div>

In [42]:
pd.concat([myseries1, myseries2], axis=1, keys=['series1', 'series2'])

    series1   series2
0  0.409201  0.383227
1  0.972325  0.533321
2  0.294228  0.275369
3  0.147080  0.829828
4  0.787371  0.362479

In [43]:
pd.concat([myframe3,myframe2])

     Employee Name    Skillset  Experience(years)
zero         Muthu      Python                  4
one            Ali  Powerpoint                  5
two         Cheong      Tablue                  2
0            Muthu         NaN                  4
1              Ali         NaN                  5
2           Cheong         NaN                  2

<div style="text-align: justify">The function concat () is applicable to a DataFrame as well.
Let us create two data frames as follows.</div>

In [44]:
myframe1 = pd.DataFrame({'Students Name': ['A','B','C'], 'Sex':['M','F','F'], 'Age':[10, 16, 17], 'School': ['Primary','Secondary','Secondary']})
myframe1

  Students Name Sex  Age     School
0             A   M   10    Primary
1             B   F   16  Secondary
2             C   F   17  Secondary

In [45]:
myframe2 = pd.DataFrame({'Students Name': ['D','E','A'], 'Class':[9, 10, 9], 'School': ['Primary','Secondary','Primary']})
myframe2

  Students Name  Class     School
0             D      9    Primary
1             E     10  Secondary
2             A      9    Primary

<div style="text-align: justify">We concatenate these two data frames as follows.</div>

In [46]:
pd.concat([myframe1,myframe2])

  Students Name  Sex   Age     School  Class
0             A    M  10.0    Primary    NaN
1             B    F  16.0  Secondary    NaN
2             C    F  17.0  Secondary    NaN
0             D  NaN   NaN    Primary    9.0
1             E  NaN   NaN  Secondary   10.0
2             A  NaN   NaN    Primary    9.0

<div style="text-align: justify">Note the NaN values have been placed in those columns whose
information is not present in individual data frames.</div>

### Merging Data
<br>
<div style="text-align: justify">The process of merging consists of combining data through
the connection of rows using one or more keys. The keys are
common columns in the DataFrames to be merged. Based on
the keys, it is possible to obtain new data in a tabular form.
The merge() function performs this kind of operation. We
may merge myframe1 and myframe2 by typing the following
command.</div>

In [47]:
pd.merge(myframe1,myframe2)

  Students Name Sex  Age   School  Class
0             A   M   10  Primary      9

<div style="text-align: justify">Note the difference between the outputs of concat () and
merge (). The merge operation merges only those columns
together for which the key entries, Student Name and Class,
are the same. However, the concat () operation returns all the
rows even with NaN values.</div>
<br>
<div style="text-align: justify">Consider the case when we have multiple key columns, and we
want to merge on the basis of only one column. In this case,
we can use the option on to specify the key for merging the
data.</div>

In [48]:
pd.merge(myframe1,myframe2, on='School')

  Students Name_x Sex  Age     School Students Name_y  Class
0               A   M   10    Primary               D      9
1               A   M   10    Primary               A      9
2               B   F   16  Secondary               E     10
3               C   F   17  Secondary               E     10

<div style="text-align: justify">In this case, the merge operation renames those key attributes,
which are common to both data frames but not used for
merging. These are Student Name_x and Student Name_y. If
we merge on the basis of Student Name, we get a completely
different result.</div>

In [49]:
pd.merge(myframe1,myframe2, on='Students Name')

  Students Name Sex  Age School_x  Class School_y
0             A   M   10  Primary      9  Primary

In [50]:

myframe1

  Students Name Sex  Age     School
0             A   M   10    Primary
1             B   F   16  Secondary
2             C   F   17  Secondary

In [51]:
myframe2

  Students Name  Class     School
0             D      9    Primary
1             E     10  Secondary
2             A      9    Primary

<div style="text-align: justify">Thus, it is important to consider the columns for merging
different data frames together.</div>
<br>
<div style="text-align: justify">We can merge on the basis of indices using join. For this
purpose, neither of the data frames should have the same
column names. Thus, we rename columns of one of the
data frames and merge both together using the following
commands.</div>

In [52]:
myframe2.columns = ['Students Name2','Class','School2']
myframe2

  Students Name2  Class    School2
0              D      9    Primary
1              E     10  Secondary
2              A      9    Primary

In [53]:
myframe1.join(myframe2)

  Students Name Sex  Age     School Students Name2  Class    School2
0             A   M   10    Primary              D      9    Primary
1             B   F   16  Secondary              E     10  Secondary
2             C   F   17  Secondary              A      9    Primary

### Combining Data
<br>
<div style="text-align: justify">Consider the case in which we have two datasets with
overlapping indices. We want to keep values from one of the
datasets if an overlapping index comes during combining
these datasets. If the index is not overlapping, then its value
is kept. This cannot be obtained either by merging or with
concatenation. The combine_first () function provided by the
Pandas library is able to perform this kind of operation. Let us
create two Series data structures.</div>

In [54]:
myseries1 = pd.Series([50, 40, 30, 20, 10],  index=[1,2,3,4,5])
myseries1

1    50
2    40
3    30
4    20
5    10
dtype: int64

In [55]:
myseries2 = pd.Series([100, 200, 300, 400],  index=[3,4,5,6])
myseries2

3    100
4    200
5    300
6    400
dtype: int64

<div style="text-align: justify">To keep the values from myseries1, we combine both series as
given below:</div>

In [56]:

myseries1.combine_first(myseries2)

1     50.0
2     40.0
3     30.0
4     20.0
5     10.0
6    400.0
dtype: float64

<div style="text-align: justify">To keep the values from myseries2, we combine both series as given below:</div>

In [57]:
myseries2.combine_first(myseries1)

1     50.0
2     40.0
3    100.0
4    200.0
5    300.0
6    400.0
dtype: float64

## Data Transformation (Refer to lecture video)
<br>
<div style="text-align: justify">The process of data transformation involves the removal or
replacement of duplicate or invalid values, respectively. It
aims to handle outliers and missing values, as well. We discuss
various data transformation techniques in the following
sections.</div>

<br>

### Removing Unwanted Data and Duplicates
<br>
<div style="text-align: justify">To remove an unwanted column, we use del command, and to
remove an unwanted row, we use drop() function. Let us apply
these commands on a DataFrame.</div>

In [ ]:
import pandas as pd
myframe5 = pd.DataFrame({'Student name':['A','B','C','D','E','F','G'], )

<div style="text-align: justify">To remove the row indexed 1, we use:</div>

<div style="text-align: justify">Duplicate rows in a dataset do not convey extra information.
These rows consume extra memory and are redundant.
Furthermore, processing these extra records adds to the cost
of computations. Thus, it is desirable to remove duplicate rows
from the data. Let us create a DataFrame with duplicate rows.</div>

<div style="text-align: justify">We note that the rows indexed 0 and 4 are duplicate. To detect
duplicate rows, we use the duplicated () function.</div>

In [ ]:
pd.

<div style="text-align: justify">To display the duplicate entries only, we can use the item_
frame.duplicated() as the index to the DataFrame item_frame.</div>

In [ ]:
item_frame[item_frame.duplicate()]

<div style="text-align: justify">To remove the duplicate entries, we use the following
command:</div>

In [ ]:
# Use drop_duplicate() to drop duplicates within an existing DataFrame

item_frame.drop_duplicates()

### Handling Outliers
<br>
<div style="text-align: justify">Outliers are values outside the expected range of a feature.
Common causes of outliers include:</div>

- Human errors during data entry;
- Measurement (instrument) errors;
- Experimental errors during data extraction or manipulation; and
- Intentional errors to test the accuracy of outlier detection methods.

<div style="text-align: justify">During the data preparation and analysis, we have to detect
the presence of unexpected values within a data structure.
For instance, let us create a DataFrame student_frame.</div>

<div style="text-align: justify">We find the age of student C to be an expected value, i.e., 60
years. This is deliberately entered wrong, and is considered as
an outlier. We describe important statistics of student_frame
    by using the <b>describe ()</b> function.</div>

In [ ]:
student_frame.describe()

<div style="text-align: justify">Note that the statistics of numeric columns is calculated and
displayed. In our case, Age is the only numeric column in the
student_frame.</div>
<br>
<div style="text-align: justify">The statistic count gives the number of elements in the
column, mean gives the average value, std provides standard
deviation, which is the average deviation of data points from
the mean of the data, min is the minimum value, max is the
maximum value, 25%, 50%, and 75% give the 25th percentile
(the first quartile  Q1), the 50th percentile (the median  Q2),
and the 75th percentile (the third quartile  Q3) of the values.</div>
<br>
<div style="text-align: justify">
High amount of standard deviation implies that there exists outliers in the dataset

In [ ]:
# Display standard deviation of the DataFrame.

student_frame.std()

<div style="text-align: justify">The presence of outliers shifts the statistics. We expect the
mean or the average age of students to be around 15 years.
However, the average age of students is 20.142857 due to the
presence of the outlier, i.e., 60 years.</div>

<div style="text-align: justify">There are different ways to detect outliers. For example, if the
difference between the mean and median values is too high,
it can indicate the presence of outliers. A better approach to
detect numeric outliers is to use InterQuartile Range (IQR). In
IQR, we divide our data into four quarters after we sort it in
ascending order.</div>

<div style="text-align: justify">Any data point that lies outside some small multiple of
the difference between the third and the first quartiles is
considered as an outlier. This difference is IQR. For example,</div>
<br>
IQR = Q3  Q1 = 15.5  12.5 = 3

Consider using box plot when plotting a value with min, max, 75% percentile (Q3), 25% percentile (Q1) and median.

(Read: https://courses.lumenlearning.com/introstats1/chapter/box-plots/)

<div style="text-align: justify">Using a typical interquartile multiplier value k=1.5, we can find
the lower and upper values beyond which data points can be
considered as outliers.</div>
<br>
IQR x 1.5 = 3 x 1.5 = 4.5

<div style="text-align: justify">We subtract this value, 4.5, from the Q1 to find the lower limit,
and add 4.5 to the Q3 to find the upper limit. Thus,</div>
<br>
Lower limit = Q14.5 = 8
<br>
Upper limit = Q3+4.5 = 20

<br>
<br>

<div style="text-align: justify">Now any value lesser than 8 or greater than 20 can be treated
as an outlier. A popular plot that shows these quartiles is
known as a Box and Whisker plot shown in the following figure:</div>

<div style="text-align: justify">To calculate lower and upper limits, we can enter the following
script:</div>

In [ ]:
Q1 = student_frame.quantile(0.25) # Representing Q1
Q2 = student_frame.quantile(0.75) # Representing Q3

IQR = Q3 - Q1 # Formula to calculate interquantile range (IQR)
IQR_mult = IQR*1.5 # Determining IQR multiplier by using k=1.5

lower = Q1 - IQR_mult #Determining lower limit of the dataframe
higher = Q3 + IQR_mult #Determining upper limit of the dataframe

# Displaying the boundary values for lower and upper limit of the dataframe determined by IQR multiplier 
print("The lower limit is = "+ lower)
print("The upper limit is = "+ higher)

In [ ]:
# Take a look at the students' ages only
student_frame2 = student_frame['Age']
student_frame2

<div style="text-align: justify">Now, we are able to filter our DataFrame, student_frame, to
    remove outliers. We access the column <b>Age</b> using student_
frame[Age], and compare it with int(lower). The result is used
as indices to student_frame. Finally, student_frame is updated
by making an assignment as follows:</div>

In [ ]:
# Update the existing dataframe using conditional operator

student_frame['Age'] = pd.Series([x for x in student_frame['Age'] if (x > int(lower))])
student_frame['Age'] = pd.Series([x for x in student_frame['Age'] if (x < int(upper))])

# Display new age of the students
student_frame['Age']

### Handling Missing or Invalid Data

<br>
<div style="text-align: justify">It is often the case that the data we receive has missing
information in some columns. For instance, some customers
data might be missing their age. If the data has a large
number of missing entries, the result of data analysis may be
unpredictable or even wrong. Missing values in a dataset can
be either</div>

- Ignored,
- Filled-in, or
- Removed or dropped.

<br>
<div style="text-align: justify">Ignoring the missing values is often not a good solution
because it leads to erroneous results. Let us create a Series
object with missing values.</div>

In [2]:
import numpy as np
import pandas as pd

myseries4 = pd.Series([10,20,30,None,40,50, np.NaN], index = [0,1,2,3,4,5,6])
print(myseries4.isnull())

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

<div style="text-align: justify">To get the indices where values are missing, we may type:</div>

In [3]:
# Use isnull() command to determine the index for which the data is null

myseries4[myseries4.isnull()]

3   NaN
6   NaN
dtype: float64

<div style="text-align: justify">We can drop the missing values by using the function <b>dropna
    ( )</b>.</div>

In [5]:
myseries_dropped = myseries4.dropna()
myseries_dropped

# Note how we need to introduce another variable to ensure that the original value is not overwritten

0    10.0
1    20.0
2    30.0
4    40.0
5    50.0
dtype: float64

<div style="text-align: justify">The process in which the missing values are filled-in is called
    <b>data imputation.</b> One of the widely used techniques is mean
value imputation, where we impute the missing values by the
average value of that particular column in which the value is
missing.</div>

In [7]:
myseries4_filled = myseries4.fillna(myseries4.mean())
myseries4_filled

0    10.0
1    20.0
2    30.0
3    30.0
4    40.0
5    50.0
6    30.0
dtype: float64

<div style="text-align: justify">Here, the values at indices 3 and 6 are filled-in by the mean or
average of the rest of the valid values. The mean is calculated
as</div>
<br>
Mean = (10+20+30+40+50)/5 = 30.

<br>
<br>

<div style="text-align: justify">Besides mean, we can impute the missing data using the
median by typing myseries4.median () in place of myseries4.
mean ().</div>

### Data Mapping

<div style="text-align: justify">The Pandas library provides useful data mapping functions to
perform numerous operations. The mapping is the creation of
a list of matches between two values. To define a mapping, we
can use dictionary objects.</div>

<div style="text-align: justify">The following functions accept a dictionary object as an
argument to perform mapping:</div>

- replace() function replaces values;
- map() function creates a new column;
- rename() function replaces the index values.

<div style="text-align: justify">The replace function replaces the matches with the desired
new values. To illustrate this idea, let us create a DataFrame.</div>

In [18]:
data = {'color' : ['blue','green','yellow','red','white'],
       'object' : ['ball','pen','pencil','paper','mug'],
       'price' : [1.2, 1.0, 0.6, 0.9, 1.7]}

myFrame = pd.DataFrame(data)
myFrame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

<div style="text-align: justify">We create a dictionary to perform mapping. Next, this dictionary is provided as an input argument to the
replace () function.</div>

In [19]:
# Replacing the value within a DatFrame using mapping argument.

mymap = {'blue':'dark blue', 'green':'light green'}
myFrame.replace(mymap) # mymap is the input argument for which the replace() function refers to

         color  object  price
0    dark blue    ball    1.2
1  light green     pen    1.0
2       yellow  pencil    0.6
3          red   paper    0.9
4        white     mug    1.7

<div style="text-align: justify">Note, the original colors blue and green have been replaced
by dark blue and light green as mapped inside the dictionary
    mymap. The function <b>replace ()</b> can also be used to replace
NaN values contained inside a data structure.</div>

In [20]:
# Replacing the value within a Series using replace() using mapping

myseries = pd.Series([1,2,np.nan,4,5,np.nan])
myseries

myseries.replace(np.nan,0)

0    1.0
1    2.0
2    0.0
3    4.0
4    5.0
5    0.0
dtype: float64

<div style="text-align: justify">To add a new column to an existing DataFrame, we again
create a dictionary object that serves as a map.</div>

In [21]:
mymap2 = {'ball':'round',
          'pencil':'long',
          'pen':'long', 
          'mug':'cylinderical',
        'paper':'rectangular'}
          
myFrame['shape'] = myFrame['object'].map(mymap2)
myFrame

    color  object  price         shape
0    blue    ball    1.2         round
1   green     pen    1.0          long
2  yellow  pencil    0.6          long
3     red   paper    0.9   rectangular
4   white     mug    1.7  cylinderical

<div style="text-align: justify">We use map () function that takes the dictionary as its input
argument, and maps a particular column of the DataFrame to
create a new column. In our case, the column named object is
used for the mapping.</div>

<br>
<div style="text-align: justify">Finally, we can rename the indices of a DataFrame using the
function rename (). We create new indices using a dictionary</div>

In [22]:
reindex = {0: 'first',
          1: 'second',
          2: 'third',
          3: 'fourth',
          4: 'fifth'}

myFrame_new = myFrame.rename(reindex) # Need to reassign the replaced index (reindex) to original DataFrame
myFrame_new

         color  object  price         shape
first     blue    ball    1.2         round
second   green     pen    1.0          long
third   yellow  pencil    0.6          long
fourth     red   paper    0.9   rectangular
fifth    white     mug    1.7  cylinderical

<div style="text-align: justify">Note that we rename the indices, and assign the result of the
right-hand side to myframe to update it. If this assignment
operation is not performed, myframe will not be updated.</div>

In [23]:
myFrame_new = myFrame
myFrame_new.rename(index={'first':1},columns={'object':'items'})

    color   items  price         shape
0    blue    ball    1.2         round
1   green     pen    1.0          long
2  yellow  pencil    0.6          long
3     red   paper    0.9   rectangular
4   white     mug    1.7  cylinderical

### Discretization and Binning

<br>
<div style="text-align: justify">Occasionally, when we have a large amount of data, we want
to transform this into discrete categories to facilitate the
analysis. For instance, we can divide the range of values of the
data into relatively smaller intervals or categories to discover
the statistics within each interval. Suppose we gather data
from an experimental study and store it in a list.</div>

<div style="text-align: justify">We find that the range of data values is 0 to 100. Thus, we can
uniformly divide this interval, suppose, into four equal parts
(bins):</div>

- the first bin contains the values between 0 and 25,
- the second between 26 and 50,
- the third between 51 and 75, and
- the last between 76 and 100.

<div style="text-align: justify">We pass these readings and bins to the function cut ().</div>

<div style="text-align: justify">We get four categories or intervals when we run the functioncut (), i.e., [(0, 25] < (25, 50] < (50, 75] < (75, 100]]. Note
that each category has a lower limit with parenthesis and the
upper limit with a bracket. This is consistent with mathematical
notation used to indicate the intervals. In the case of a square
bracket, the number belongs to the range, and if it is a
parenthesis, the number does not belong to the interval. In
(0,25], 0 is excluded, whereas 25 is included. To count the
number of elements in each bin, we may write:</div>

<div style="text-align: justify">In place of numbers, we can give meaningful names to the
bins.</div>

<div style="text-align: justify">The Pandas library provides the function qcut() that divides
the data into quantiles. qcut() ensures that the number of
occurrences for each bin is equal, but the ranges of each bin
may vary.</div>

<div style="text-align: justify">To check the number of elements in each bin, we type:</div>

### Aggregating Data

<br>

<div style="text-align: justify">Aggregation is the process of grouping data together into a
list or any other data structure. The aggregation uses statistical
functions such as mean, median, count, or sum to combine
several rows together. The combined data resulting from data
aggregation is easier to analyze. It protects the privacy of an
individual and can be matched with other sources of data. Let
us create a DataFrame to understand the concept of grouping
or aggregation.</div>

<div style="text-align: justify">Note that the column color has two entries for both white
and red. If we want to group the data based upon the column
color, for example, we may type:</div>

<div style="text-align: justify">Thus, we get three distinct groups, blue, red, and white, by
invoking the attribute groups. We can find the average value
and sum of numeric features for each group as well.</div>

<div style="text-align: justify">The data aggregation can be performed using more than one
column. For instance, we may group data by both color and
object. It is called hierarchical grouping. We may type the
following commands.</div>

<div style="text-align: justify">Let us create a new dataframe <b>myframe2</b> that is the same as
myframe except for an extra entry [red,pencil,0.8] at index
5.</div>

<div style="text-align: justify">Now, we group myframe2 by color as well as by object.</div>

<div style="text-align: justify">We find the average value and sum of numeric features for
each group.</div>

## Selection of Data

<br>
<div style="text-align: justify">Sometimes, we have to work with a subset of a dataset. In this
case, we select data of interest from the dataset. Let us work
on an already created DataFrame, myframe4.</div>

<div style="text-align: justify">We can select a single column.</div>

<div style="text-align: justify">Alternatively, we can use the column name as an attribute of
our DataFrame.</div>

<div style="text-align: justify">It is possible to extract or select a few rows from the
DataFrame. To extract rows with index 1 and 2 (3 excluded),
type the following command.</div>

<div style="text-align: justify">The attribute <b>loc</b> accesses rows by the names of their indices.</div>

<div style="text-align: justify">The rows and columns of a DataFrame can be given meaningful
names.</div>

<div style="text-align: justify">We can add columns to the existing DataFrame by using a
new column name and assigning value(s) to this column.</div>

<div style="text-align: justify">In the aforementioned example, we have used Numpys random
module to generate an array of three random numbers from 0
(inclusive) to 100 (exclusive).</div>

<br>

<div style="text-align: justify">Finally, we can change a single value by selecting that element
and updating it. For example, to update element 1 of col1, we
write:</div>

<div style="text-align: justify">Similar to the Series, we use the function isin() to check the
membership of a set of values. For instance,</div>

<div style="text-align: justify">If we use the Boolean values returned by myframe4.
isin([1,4,99]) as indices to the DataFrame, we get NaN values
at locations where our specified values are not present.
myframe4</div>

<div style="text-align: justify">To delete a column from the existing DataFrame, use the
keyword del.</div>

<div style="text-align: justify">Let us display the already created DataFrame <b>myframe3.</b></div>

<div style="text-align: justify">We can select a single row or multiple rows from a DataFrame.
Suppose we are interested in those employees having more
than four years of experience. We use the following command
for the selection.</div>

<div style="text-align: justify">In the aforementioned example, myframe3[Experience
(years)]>4 returns values that are used as indices to myframe3
to display only those employees who have an experience of more than four years. Finally, to transpose any DataFrame, we
use:</div>